src/cf/Reports/уатКарточкаРаботыТСрасширенный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>уатКарточкаРаботыТСрасширенный</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/Enums/уатВидыМоделейТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыМоделейТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автотранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прицеп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвиационныйТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорскойТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Reports/уатКарточкаРаботыТСрасширенный/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
#Область ПрограммныйИнтерфейс

// Задает настройки размещения вариантов отчетов в панели отчетов.
// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. ""Реквизиты для изменения"" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Карточка работы ТС (расширенный)");
	НастройкиВарианта.Описание = НСтр("en='Report provides information about the operation of vehicles on waybills.';ru='Отчет позволяет получить информацию о работе транспортных средств по путевым листам.'");
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Возвращает список прицепов по путевому листу
//
// Параметры:
//  ПЛ	 - Документ.уатПутевойЛист	 - ссылка на документ
// 
// Возвращаемое значение:
//  Список - Список прицепов
//
Функция ПрицепыПЛсписок(ПЛ) Экспорт
	Рез = Новый СписокЗначений;
	
	Если ТипЗнч(ПЛ) = Тип("ДокументСсылка.уатТехнологическийПутевойЛист") Тогда
		Возврат Рез;
	КонецЕсли;
	
	Для Каждого ТекПрицеп Из ПЛ.Прицепы Цикл
		Если (ТекПрицеп.ТС.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Автотранспорт
			ИЛИ ТекПрицеп.ТС.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Прицеп)
			И Рез.НайтиПоЗначению(ТекПрицеп.ТС) = Неопределено Тогда
			Рез.Добавить(ТекПрицеп.ТС, Строка(ТекПрицеп.ТС));
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекЗадание Из ПЛ.Задание Цикл
		Если (ТекЗадание.Прицеп1.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Автотранспорт
			ИЛИ ТекЗадание.Прицеп1.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Прицеп)
			И Рез.НайтиПоЗначению(ТекЗадание.Прицеп1) = Неопределено Тогда
			Рез.Добавить(ТекЗадание.Прицеп1, Строка(ТекЗадание.Прицеп1));
		КонецЕсли;
		Если (ТекЗадание.Прицеп2.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Автотранспорт
			ИЛИ ТекЗадание.Прицеп2.ВидМоделиТС = Перечисления.уатВидыМоделейТС.Прицеп)
			И Рез.НайтиПоЗначению(ТекЗадание.Прицеп2) = Неопределено Тогда
			Рез.Добавить(ТекЗадание.Прицеп2, Строка(ТекЗадание.Прицеп2));
		КонецЕсли;
	КонецЦикла;
	
	Если Рез.Количество() = 0 Тогда
		Рез = Неопределено;
	ИначеЕсли Рез.Количество() = 1 Тогда
		Рез = Рез[0].Значение;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
